#include <iostream>
#include <math.h>
using namespace std;
int main()
{
	double x1, y1, x2, y2, x3, y3, a, b, c, x4, y4, ii = 0;
	setlocale(LC_ALL, "Russian");
	cout << "введите координаты трех точек:" << endl;
	cout << "введите координаты (x1,y1)" << endl;
	cin >> x1 >> y1;
	cout << "введите координаты (x2,y2)" << endl;
	cin >> x2 >> y2;
	cout << "введите координаты (x3,y3)" << endl;
	cin >> x3 >> y3;
	a = (sqrt((x1 - x2) * (x1 - x2) + (y1 - y2) * (y1 - y2)));
	b = (sqrt((x1 - x3) * (x1 - x3) + (y1 - y3) * (y1 - y3)));
	c = (sqrt((x2 - x3) * (x2 - x3) + (y2 - y3) * (y2 - y3)));
	if (((a == b) && (abs(c - (a * sqrt(2)))<0.01)))
	{
		x4 = x2 + x3 - x1;
		y4 = y2 + y3 - y1;
		cout << "координаты точек могут быть вершинами квадрата" << endl;
		cout << "координаты четвертой вершины: x4=" << x4 << ", y4=" << y4;
		ii = 1;
	}
		cout << a * sqrt(2) << endl;
	if (((a == c) && (abs(b - (a * sqrt(2)))<0.01)))
	{
		x4 = x1 + x3 - x2;
		y4 = y1 + y3 - y2;
		cout << "координаты точек могут быть вершинами квадрата" << endl;
		cout << "координаты четвертой вершины: x4=" << x4 << ", y4=" << y4;
		ii = 1;
	}
	if (((c == b) && (abs(a - (b * sqrt(2)))<0.01)))
	{
		x4 = x1 + x2 - x3;
		y4 = y1 + y2 - y3;
		cout << "координаты точек могут быть вершинами квадрата" << endl;
		cout << "координаты четвертой вершины: x4=" << x4 << ", y4=" << y4;
		ii = 1;
	}
	if (ii == 0)
	{
		cout << "координаты точек не могут быть вершинами квадрата";
	}
	return 0;
}
